stress_test_results-ab1000/wrk_test_2.txt
Running 30s test @ http://127.0.0.1:30070/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   138.53ms   24.75ms 293.12ms   73.75%
    Req/Sec     0.92k   203.28     1.47k    63.04%
  218863 requests in 30.06s, 463.99MB read
  Socket errors: connect 3987, read 0, write 0, timeout 0
Requests/sec:   7280.17
Transfer/sec:     15.43MB